test-resources/sample-request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <svc:GetPartTypeRequest xmlns:svc="http://example.com/svc">
      <part>widget</part>
    </svc:GetPartTypeRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
